---
kind: method
id: M:Autodesk.Revit.DB.FamilyTypeSet.Clear
source: html/901c1504-43bb-3cb5-68ac-72623b53000f.htm
---
# Autodesk.Revit.DB.FamilyTypeSet.Clear Method

Removes every item from the set, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```